### Data Preparation & Data Cleaning

In [13]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [14]:
# Load the dataset : Births and Deaths projected to 2100
dataset_path = '../../dataset/our-worl-data/births-and-deaths-projected-to-2100.csv'
df = pd.read_csv(dataset_path)

In [15]:
df.shape

(151, 7)

In [16]:
df.head(100)

,Entity,Code,Year,Deaths - Sex: all - Age: all - Variant: estimates,Deaths - Sex: all - Age: all - Variant: medium,Births - Sex: all - Age: all - Variant: estimates,Births - Sex: all - Age: all - Variant: medium
0,Indonesia,IDN,1950,1435160.0,NaN,2783163.0,NaN
1,Indonesia,IDN,1951,1444298.0,NaN,2892411.0,NaN
2,Indonesia,IDN,1952,1454169.9,NaN,3005894.0,NaN
3,Indonesia,IDN,1953,1468481.9,NaN,3120435.0,NaN
4,Indonesia,IDN,1954,1483242.0,NaN,3244910.0,NaN
...,...,...,...,...,...,...,...
95,Indonesia,IDN,2045,NaN,3165872.0,NaN,4103530.8
96,Indonesia,IDN,2046,NaN,3213025.0,NaN,4067058.0
97,Indonesia,IDN,2047,NaN,3258542.0,NaN,4036947.0
98,Indonesia,IDN,2048,NaN,3301831.0,NaN,4005891.0
99,Indonesia,IDN,2049,NaN,3345086.0,NaN,3971275.0

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 151 entries, 0 to 150
Data columns (total 7 columns):
 #   Column                                             Non-Null Count  Dtype
---  ------                                             --------------  -----
 0   Entity                                             151 non-null    object
 1   Code                                               151 non-null    object
 2   Year                                               151 non-null    int64
 3   Deaths - Sex: all - Age: all - Variant: estimates  74 non-null     float64
 4   Deaths - Sex: all - Age: all - Variant: medium     77 non-null     float64
 5   Births - Sex: all - Age: all - Variant: estimates  74 non-null     float64
 6   Births - Sex: all - Age: all - Variant: medium     77 non-null     float64
dtypes: float64(4), int64(1), object(2)
memory usage: 8.4+ KB

In [18]:
df.describe()

,Year,Deaths - Sex: all - Age: all - Variant: estimates,Deaths - Sex: all - Age: all - Variant: medium,Births - Sex: all - Age: all - Variant: estimates,Births - Sex: all - Age: all - Variant: medium
count,151.000000,7.400000e+01,7.700000e+01,7.400000e+01,7.700000e+01
mean,2025.000000,1.664870e+06,3.451120e+06,4.544860e+06,3.660719e+06
std,43.734045,2.457474e+05,5.597505e+05,5.628311e+05,5.144732e+05
min,1950.000000,1.435160e+06,2.161269e+06,2.783163e+06,2.825757e+06
25%,1987.500000,1.510933e+06,3.071722e+06,4.501296e+06,3.208328e+06
50%,2025.000000,1.563824e+06,3.738411e+06,4.737806e+06,3.634278e+06
75%,2062.500000,1.753559e+06,3.895570e+06,4.871008e+06,4.174009e+06
max,2100.000000,2.779186e+06,3.943967e+06,5.157679e+06,4.468312e+06

In [19]:
"""
    Counts the number of missing values in each column of the DataFrame `df`.

    Note:
    - The null data corresponds to the years 2024 - 2100.
    - Only data up to the year 2023 is used in this analysis.
"""

df.isna().sum()

Entity                                                0
Code                                                  0
Year                                                  0
Deaths - Sex: all - Age: all - Variant: estimates    77
Deaths - Sex: all - Age: all - Variant: medium       74
Births - Sex: all - Age: all - Variant: estimates    77
Births - Sex: all - Age: all - Variant: medium       74
dtype: int64

In [20]:
# Menghapus kolom births & deaths medium variant (2024 - 2100)
df.drop(columns=['Births - Sex: all - Age: all - Variant: medium', 'Deaths - Sex: all - Age: all - Variant: medium'], inplace=True)

In [21]:
df.columns

Index(['Entity', 'Code', 'Year',
       'Deaths - Sex: all - Age: all - Variant: estimates',
       'Births - Sex: all - Age: all - Variant: estimates'],
      dtype='object')

In [22]:
df.head()

,Entity,Code,Year,Deaths - Sex: all - Age: all - Variant: estimates,Births - Sex: all - Age: all - Variant: estimates
0,Indonesia,IDN,1950,1435160.0,2783163.0
1,Indonesia,IDN,1951,1444298.0,2892411.0
2,Indonesia,IDN,1952,1454169.9,3005894.0
3,Indonesia,IDN,1953,1468481.9,3120435.0
4,Indonesia,IDN,1954,1483242.0,3244910.0

In [23]:
# Menghapus baris yang memiliki nilai null (data tahun 2024 - 2100)
df.dropna(inplace=True)
df.isna().sum()

Entity                                               0
Code                                                 0
Year                                                 0
Deaths - Sex: all - Age: all - Variant: estimates    0
Births - Sex: all - Age: all - Variant: estimates    0
dtype: int64

In [24]:
# Menyimpan hasil
df.to_csv('../../dataset/cleaned-data/cleaned_data_births_deaths.csv', index=False)